src/components/Showcases/showcaseData/ab_test_result.txt
rainman@rainman:~/Documents/slack-clone$ ab -n 5000 -c 500 http://127.0.0.1:3030/
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3030

Document Path:          /
Document Length:        139 bytes

Concurrency Level:      500
Time taken for tests:   0.710 seconds
Complete requests:      5000
Failed requests:        0
Non-2xx responses:      5000
Total transferred:      3330000 bytes
HTML transferred:       695000 bytes
Requests per second:    7043.05 [#/sec] (mean)
Time per request:       70.992 [ms] (mean)
Time per request:       0.142 [ms] (mean, across all concurrent requests)
Transfer rate:          4580.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.9      1      10
Processing:     4   37  11.2     35      65
Waiting:        4   30   8.8     29      62
Total:         14   39  11.9     36      66